app/views/posts/show.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "post_tags" ON "tags"."id" = "post_tags"."tag_id" WHERE "post_tags"."post_id" = ?  [["post_id", 1]]
---
<ul>
<% @post.tags.each do |tag|%>