app/controllers/posts_controller.rb

INSERT INTO "posts" ("name", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Test"], ["content", "NEW TAG"], ["created_at", "2016-02-16 18:23:53.725903"], ["updated_at", "2016-02-16 18:23:53.725903"]]
INSERT INTO "post_tags" ("tag_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["tag_id", 1], ["post_id", 3], ["created_at", "2016-02-02 06:18:48.203408"], ["updated_at", "2016-02-02 06:18:48.203408"]]
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "adfsdg"], ["created_at", "2016-02-16 18:23:53.728331"], ["updated_at", "2016-02-16 18:23:53.728331"]]
---
  def create
    @post = Post.new(post_params(:name, :content))

    respond_to do |format|
      if @post.save

        if params[:post][:tag_ids] != []
          params[:post][:tag_ids].each do |id|
            PostTag.create(post_id: @post.id, tag_id: id)

INSERT INTO "post_tags" ("post_id", "tag_id") VALUES (?, ?)  [["post_id", 1], ["tag_id", 21]]
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "ABCD TAG"], ["created_at", "2016-02-16 18:28:17.303973"], ["updated_at", "2016-02-16 18:28:17.303973"]]
---
  def update
    respond_to do |format|
      if @post.update(post_params(:name, :content))
        if params[:post][:tag_ids] != []
          params[:post][:tag_ids].each do |id|
            PostTag.create(post_id: @post.id, tag_id: id)